Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A03B.tmx
Source language: en_us
Languages: zh_cn

source: Deadly Explosions Hit China's Port of Tianjin
zh_cn: 中国天津市发生惨重爆炸事故

source: TIANJIN, China - Thunderous, fiery explosions at a warehouse containing hazardous goods traumatized this northeast port city late Wednesday, killing at least 17 people, injuring at least 400, shattering glass on scores of high- rise buildings and causing other extensive damage.
zh_cn: 中国天津电——星期三晚些时候，一放置有危险货物的仓库发生了响如雷鸣且炽烈的爆炸，把这座中国东北部港口城市蒙上了创伤。爆炸导致至少17人死亡，至少400人受伤。被炸飞的玻璃碎片落在了许多高建筑上并导致其他大范围破坏。

source: The force of the blasts registered on earthquake scales and was felt miles away.
zh_cn: 爆炸的威力达到地震规模，数英里外都能察觉到。

source: As of Thursday morning, an unknown number of people remained unaccounted for in the wreckage, the Tianjin Police Department said in a statement, and 32 of the injured were in critical condition, among them six firefighters.
zh_cn: 到星期四早上为止，据天津市警察厅声明，埋在废墟中下落不明人数仍然未知，其中伤者中的32人情况严重，6名是消防员。

source: The death toll is expected to rise.
zh_cn: 预计死亡人数会上升。

source: The official Xinhua news agency and other state-run news outlets posted graphic video clips of the blasts, showing a fire and a huge flash of light that resembled a mushroom cloud illuminating the darkness over Tianjin, a city of 14 million that is one of China's most important commercial trade centers.
zh_cn: 新华社及其他官方新闻媒体发布的爆炸现场视频片段显示，大火和一束巨大的火光如同一朵蘑菇云，照亮了漆黑的天津上空。天津是一座有着1400万人口的城市，是中国最重要的商业贸易中心之一。

source: Another video posted by the state-run newspaper People's Daily showed a person blown down by a wall of shattering glass and debris.
zh_cn: 官方报社人民日报发布的另一段视频显示，有个人被一大片碎玻璃及残骸击倒。

source: "The air pressure from the blast was so strong it just knocked me down in one fell swoop," said Han Tao, 30, a truck driver who lives on the 13th floor of a building just over a mile from the site of the explosion.
zh_cn: “爆炸产生的气压非常强烈，瞬间把我击倒，”30岁的货车司机韩涛说。他住在离爆炸超过一英里的一建筑物的13楼。

source: Another resident, Wang Dong, 55, said the explosions appeared to travel through the sewer pipes.
zh_cn: 另外一名55岁的居民王东称，爆炸似乎传到了下水管道。

source: "The whole sky lit up like it was daytime," he said.
zh_cn: 他说，“整片天空如同白天一样亮。”

source: Xinhua said the initial blast originated at a warehouse in the Binhai district of Tianjin around 11:30 p.m. and set off another explosion 30 minutes later that was even more powerful - roughly the equivalent of 21 tons of TNT, the authorities said.
zh_cn: 新华社称，晚上11点30分时，首次爆炸发生在滨海新区一仓库。而30分钟后，引发了另外一次更为强烈的爆炸——当局称该次爆炸威力等同于21吨梯恩梯炸药。

source: The police in Tianjin said the explosion took place at a warehouse owned by Rui Hai International Logistics, a private company that was licensed to handle hazardous cargo.
zh_cn: 天津市警方称，爆炸发生在一瑞海国际物流仓库，该公司为私有企业，持有危险货物运输执照。

source: According to People's Daily, the company's top official was detained for questioning.
zh_cn: 据《中国日报》，企业最高负责人已被拘留问话。

source: Company officials could not immediately be reached early Thursday.
zh_cn: 星期四早上，企业负责人们都无法立即取得联系。

source: At least 17 people were killed, including several firefighters, and hundreds were injured in thunderous blasts that were felt miles away. An unknown number of people were missing.
zh_cn: 在这场数英里外都能察觉的爆炸事故中，至少有包括多名消防员在内的17人死亡，另外还有数百人受伤，失踪人数未知。

source: The precise nature of the materials that exploded was not made clear, and there was no indication whether the blast was accidental or intentional.
zh_cn: 爆炸物品的准确种类仍旧不清楚，并且无迹象表明该爆炸是人为还是意外。

source: Early reports suggested that firefighters had responded to a blaze about 40 minutes before the first explosion; according to the Beijing News, at least three of the dead were firefighters and a half-dozen fire trucks were destroyed.
zh_cn: 早前的一些报道称，首次爆炸前40分钟，消防员们回应了一火灾；据北京新闻，至少有3名消防员死亡以及6辆消防车被摧毁。

source: But on Thursday, People's Daily reported that 11 firefighters had been killed, though it was not immediately clear whether those 11 were among the 17 people confirmed dead.
zh_cn: 而在星期四，人民日报则报道称，消防员死亡人数已达11人，但不清楚这11人是否包括在已确认死亡的17人里。

source: Photographs posted on Chinese social media showed the skeletal remains of buildings and row upon row of incinerated Volkswagen Beetles.
zh_cn: 中国社会媒体发布的图片显示，建筑物上布有骨骼，排成一列已被烧毁的大众甲壳虫系列轿车上也布有。

source: The injured, many of them suffering lacerations caused by flying glass and debris, flooded local hospitals; at the hospital closest to the scene, Taida Medical Center, emergency workers set up tents in a parking lot to treat the wounded while dozens of anxious people awaited word on injured relatives.
zh_cn: 伤者涌到了当地医院，大部分都是被炸飞的碎玻璃和残骸擦伤；离事发现场最近的台达医疗中心的紧急救助工作人员在停车场内搭起了的帐篷里治疗伤者，另外数十焦急的群众等待着受伤亲人的消息。

source: At one point, a man who was told that his son had just died began wailing, and the crowd went silent.
zh_cn: 在某一时刻，一被告知儿子去世的男子失声大哭，人群骤然鸦雀无声。

source: "God, why are you so cruel?" he yelled. "Son, I want to go with you."
zh_cn: “天啊，你怎么这么狠心？”他大声地喊，“儿子，爸爸要和你一起走。”

source: As daylight broke Thursday, an enormous black plume of smoke hung over the horizon.
zh_cn: 星期四天一亮，一片茫茫如黑羽毛似的浓烟挂在地平线上。

source: Residents of a newly constructed apartment complex not far from the port gathered on the street wearing disposable face masks as injured people, just released from the hospital, hobbled down the street bewildered.
zh_cn: 一离港口不远的新建公寓区的居民们聚集在街道上，脸带着一次性面具。此时，伤者也刚刚离开医院，头晕目眩地、一瘸一拐地走在大街上。

source: The pavement was carpeted with glass; up above, every window in the complex of 33-story buildings had been blown in, and curtains fluttered eerily through the jagged openings.
zh_cn: 人行道布满玻璃碎；往上看，公寓区里一座33层高的建筑所有窗户都破了，窗帘由锯齿般的裂口怪异地悬挂摆动着。

source: The tires of cars on the street were flat, and the side of a shipping container was pressed in as if a giant had pushed it in with a thumb.
zh_cn: 停止街上的轿车轮胎穿了，有被一船运集装箱的一边插到的，如同被一巨人用它的拇指挤压着。

source: Across the street, a row of temporary prefabricated structures typically used on Chinese construction sites was shredded.
zh_cn: 横穿街道，一排专门用于中国式建筑的临时装配式结构被撕碎了。

source: Su Zhaoqing, 65, a construction worker, said he had been sleeping on the lower level of a bunk bed when the entire building collapsed, causing scores of injuries among the more than 2,000 men who were crammed into the structure.
zh_cn: 65岁的建筑工人苏照清说，整座建筑倒塌时他睡在一双层床下铺。有超过2000工人挤在这里，倒塌造成了大量工人受伤。

source: "Everything just fell on my face, but I managed to crawl out," said Mr. Su, whose head was wrapped in a blood-soaked bandage.
zh_cn: “尽管所有东西都朝我脸上掉下来，但是我想着要爬出来，”苏先生说，那时他的头上绑着浸满血迹的绑带。

source: Police officers cordoned off entry to the blast area, and security guards prevented residents from returning to their homes.
zh_cn: 警方在爆炸区入口拉起了警戒线，而保安阻止居民返回区域内的家。

source: The Beijing News reported that more than 400 Tianjin residents had lined up to donate blood at the Fifth Center Hospital.
zh_cn: 据北京新闻报道，有超过400天津居民在第五中心医院排起了队伍捐血。

source: A taxi driver taped a message to his rear window offering rides to the families of the victims.
zh_cn: 一出租车司机在其后车窗贴着一信息，为受害者家庭提供免费乘坐服务。

source: According to the China Earthquake Administration's official account on Weibo, a web messaging network similar to Twitter, the first explosion registered as a magnitude 2.3.
zh_cn: 根据中国地震局官方微博信息，第一次爆炸威力可及2.3级地震。

source: It said a second explosion was measured at magnitude 2.9.
zh_cn: 据说，第二次则达2.9级地震威力。
